{
  "content": "Change Log",
  "embeds": [
    {
      "title": "o7 Goes Public!",
      "description": " * Blueprint command available\n * Market Price command available\n * Application command available\n * Set Role command available\n * Help command available",
      "footer": {
        "text": "By JB"
      },
      "timestamp": "2020-09-16T05:00:00.000Z"
    },
    {
      "title": "Blueprints go mobile!",
      "fields": [
        {
          "name": "New Features & Updates",
          "value": " * Application system will wait for half a second before asking the next question to prevent message overlaps.\n * New Prefix command available! Set a custom prefix for o7 on your Discord server with the **prefix** command. *note: Only server administrators can use this.*\n * Blueprint command no longer requires a hyphen between the name of blueprint and skill levels\n * Caching of market data so requests can be returned faster and bot can still give prices if the market-data source site goes down for a time.\n * Added section totals on blueprints!\n * Updated text on Market Item search.\n * Added **blueprintm** | **bpm** command for a more mobile friendly view of blueprints!\n* Updated help text! Help text is not sent to you via direct message.\n* Added these change logs! You can view changelogs anytime with the **changelog** command."
        },
        {
          "name": "Bug Fixes",
          "value": " * Regex updated thanks to `Stokholm` which removes the requirement to have a hyphen between blueprint name and skill levels as well as fixes bugs with the parsing.\n * Blueprint cost calculations take into account quantity of items built, so it's more accurate for drones.\n * Fuzzy searching tuned to improve search results."
        },
        {
          "name": "Known Issues",
          "value": "Some market items are not available and you'll get a different item even when searching the exact name. This is due to the item you're searching for not existing at all in the data set. This will be addressed in a future update."
        }
      ],
      "footer": {
        "text": "By JB"
      },
      "timestamp": "2020-09-18T05:00:00.000Z"
    },
    {
      "title": "Did someone ask about Planetary Resources?",
      "fields": [
        {
          "name": "New Features & Updates",
          "value": " * Added Planetary Resource command! Now you can search for the best locations to set up your mining arrays near your home station.\n* Added jump distance command to quickly let you know how far away any two systems are.\n* Added safer jump distance command to find the distance between two systems if you prefer to stick to hi sec systems."
        }
      ],
      "footer": {
        "text": "By JB"
      },
      "timestamp": "2020-09-20T12:13:00.000Z"
    }
  ]
}