{
  "embeds": [
    {
      "title": "o7 Help",
      "description": "**Most all commands have their own help available by sending the word \"help\"  after the command** \nfor example: !bp help\n\n*This documentation assumes commands use the prefix `!` a server may have configured a different prefix for commands.*",
      "url": "https://discord.gg/PfruVg4",
      "color": 7506394,
      "fields": [
        {
          "name": "Commands",
          "value": "**!blueprint** or **!bp** - Get information about what it will take to manufacture items.\n\n**!blueprintm** or **!bpm** - Mobile friendly display for blueprints\n\n**!pricecheck** or **!pc** - Retrieves market data based on provided search terms.\n\n**!planetaryresources** or **!pr** - Discover the location of a desired planetary resource within a number of jumps from any system.\n\n**!jumps** or **!j** - Find out the shortest jumps distance between two systems.\n\n**!safejumps** or **!sj** - Find out the distance to travel between two systems if using the safer option that prefers hi sec systems over low & null.\n\n"
        },
        {
          "name": "Beta Commands",
          "value": "*Beta commands are works in progress and may have missing information and/or missing features*\n\n**!item** or **!i** - Look up details about any item in game quickly! Get the full stats of any ship!  *work in progress, not all info is available yet*\n\n**!apply** - Will ask the user questions that have been configured by the server admins and post the users answers in a specified channel. \n"
        },
        {
          "name": "Informational Commands",
          "value": "**!help** - Displays this help text.\n\n**!changelog** - Want to know what the most recent changes are with your favorite Eve Echoes bot? Just ask, and I'll send them to you.\n\n**!dataretention** - View the data retention policy for this bot.\n\n**!invite** - Get a link you can use to invite this bot to your server."
        }
      ],
      "thumbnail": {
        "url": "https://i.imgur.com/kBKDFlS.png"
      }
    },
    {
      "title": "Administrative Commands",
      "description": "By default, these commands require administrator permissions on your server to execute.",
      "color": 835726,
      "fields": [
        {
          "name": "Commands",
          "value": "**!prefix** - Set a custom prefix that this bot will respond to on your server.\n\n**!appconfig** - Used to set the questions the bot will ask a user who uses the **!apply** command as well as the channel completed applications will be posted to.\n\n**!setrole** - Assigns discord role to a member."
        }
      ]
    },
    {
      "title": "Support the developer",
      "description": "You can support me on Patreon!\n\nYour support will help to keep o7 regularly updated and allow me to spend the time to add new features.\n\nSupporters will receive a unique role on the o7 Dev discord and you can even gain access to the development build of o7 to test out features before they are released!\n\nhttps://www.patreon.com/o7bot",
      "url": "https://www.patreon.com/o7bot",
      "color": 16313856,
      "fields": [
        {
          "name": "If you want to support, but don't have the $",
          "value": "You can send me ISK in Eve Echoes! Time I don't spend farming means more time I can spend adding features to this bot.\n\nSend ISK via contract to `Evelyn Bray` in Eve Echoes. Be sure to tell me your Discord ID on the contract if you'd like the supporter role on the o7 Dev Discord server."
        }
      ]
    },
    {
      "title": "Thanks & Credits",
      "fields": [
        {
          "name": "o7 Dev Discord",
          "value": "Thank you for taking the time to use my bot. I am always open to suggestions for this bot on my development server.\n<https://discord.gg/PfruVg4>"
        },
        {
          "name": "Invite o7 to your own Discord server",
          "value": "If you would like to invite this bot to your own discord, you may use this link <https://discord.com/oauth2/authorize?client_id=753820564665270333&scope=bot&permissions=268954688>"
        },
        {
          "name": "Market Data",
          "value": "\nSpecial Thanks to <https://www.reddit.com/user/eve-echoes-market/> for creating <https://eve-echoes-market.com> where this bot queries for market data.\n"
        },
        {
          "name": "And these Amazing o7 Supporters!",
          "value": "◆ **Trading Tycoon** ◆ **Pluto York** ◆"
        }
      ]
    }
  ]
}